app/views/items/_index.html.erb

  <% if @project.items.empty? %>
---
SELECT  1 AS one FROM "items" WHERE "items"."project_id" = ? LIMIT 1  [["project_id", 11]]
SELECT "items".* FROM "items" WHERE "items"."project_id" = ?  [["project_id", 11]]