app/controllers/items_controller.rb

INSERT INTO "items" ("action", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["action", "Login to your heroku account"], ["project_id", 1], ["created_at", "2015-08-06 17:40:55.670085"], ["updated_at", "2015-08-06 17:40:55.670085"]]
---
  def create
    @item = @project.items.build(item_params)

    respond_to do |format|
      if @item.save

SELECT  "items".* FROM "items" WHERE "items"."project_id" = ? AND "items"."id" = ? LIMIT 1  [["project_id", 13], ["id", 8]]
---
  def edit
    @item = @project.items.find(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."project_id" = ? AND "items"."id" = ? LIMIT 1  [["project_id", 11], ["id", 6]]
UPDATE "items" SET "action" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["action", "Click on \"Ruby Get Started\""], ["updated_at", "2015-08-06 17:42:16.625308"], ["id", 3]]
---
  def update
    @item = @project.items.find(params[:id])

    respond_to do |format|
      if @item.update(item_params)