app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.all

INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Launch this lovely app onto heroku"], ["created_at", "2015-08-06 17:40:41.738722"], ["updated_at", "2015-08-06 17:40:41.738722"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "My New Rails Project CHANGING THE NAME"], ["updated_at", "2015-08-04 03:32:22.343386"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 11]]
---
  def destroy
    @project.destroy

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 6]]
---
  def clear
    @project.items.complete.destroy_all

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 14]]
---
  def set_project
    @project = Project.find(params[:id])